Documents/Сервис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Сервис</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.ТребованиеНакладная</xr:Item>
				<xr:Item>Document.ПеремещениеМалоценкиВЭксплуатации</xr:Item>
				<xr:Item>Document.ПеремещениеОС</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТребованиеНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеМалоценкиВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыСервиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисныйЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисныеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТНОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТНПолучения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПоломки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбращения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Сервис_ТипОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРемонта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидРемонта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПолучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатРемонта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипРемонта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>(Общ) </Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРемонта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидРемонта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПолучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатРемонта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипРемонта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРемонта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидРемонта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПолучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатРемонта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипРемонта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидРемонта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Платный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бесплатный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоставкаОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоваяПочта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыОтправкиДокументовПоПочте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыОтправкиДокументовПоПочте</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтправленПоПочте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтправке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Монтажник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерЦОА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кладовщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерИМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппыПрав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпрГруппыПравДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>тчПодразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Сервис/Ext/ObjectModule.bsl
Перем СтатусОтправкиПоПочте Экспорт;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОснование 	= ДанныеЗаполнения;
	Организация 		= ДанныеЗаполнения.Организация;
	Подразделение		= ДанныеЗаполнения.Подразделение;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Товары.Загрузить(ДанныеЗаполнения.Товары.Выгрузить());
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Контрагент			= ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента 	= ДанныеЗаполнения.ДоговорКонтрагента;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТребованиеНакладная") Тогда
		Контрагент = ?(ЗначениеЗаполнено(ДанныеЗаполнения.Контрагент), ДанныеЗаполнения.Контрагент, ДанныеЗаполнения.Абонент);
		Товары.Загрузить(ПолучитьДанныеДляСервисаТребование(ДанныеЗаполнения));
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеМалоценкиВЭксплуатации") Тогда
		Оборудование.Загрузить(ПолучитьДанныеДляСервисаПеремещениеМалоценки(ДанныеЗаполнения));			
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеОС") Тогда
		ОС.Загрузить(ПолучитьДанныеДляСервисаПеремещениеОС(ДанныеЗаполнения));		
	КонецЕсли;
	
	Для Каждого стрТовар из Товары Цикл
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			стрТовар.Склад = ДанныеЗаполнения.СкладОтправитель;	
		КонецЕсли;
		стрТовар.ВидРемонта = Перечисления.ВидРемонта.Бесплатный;
	КонецЦикла;
	
	Для Каждого стрТовар из Оборудование Цикл
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			стрТовар.Склад = ДанныеЗаполнения.СкладОтправитель;	
		КонецЕсли;
		стрТовар.ВидРемонта = Перечисления.ВидРемонта.Бесплатный;
	КонецЦикла;
	
	Для Каждого стрТовар из ОС Цикл
		стрТовар.ВидРемонта = Перечисления.ВидРемонта.Бесплатный;
	КонецЦикла;
	
	ЗаполнитьПолучателей();
	
КонецПроцедуры

Процедура ЗаполнитьПолучателей() Экспорт
	
	Получатели.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПользователитчПодразделения.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.Пользователи.тчПодразделения КАК ПользователитчПодразделения
	|ГДЕ
	|	ПользователитчПодразделения.Подразделение = &Подразделение
	|	И ПользователитчПодразделения.Ссылка.Кладовщик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПользователитчПодразделения.Ссылка
	|ИЗ
	|	Справочник.Пользователи.тчПодразделения КАК ПользователитчПодразделения
	|ГДЕ
	|	ПользователитчПодразделения.Подразделение = &Подразделение
	|	И ПользователитчПодразделения.Ссылка.МенеджерЦОА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПользователитчПодразделения.Ссылка
	|ИЗ
	|	Справочник.Пользователи.тчПодразделения КАК ПользователитчПодразделения
	|ГДЕ
	|	ПользователитчПодразделения.Ссылка.МенеджерИМ";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр 				= Получатели.Добавить();	
		Новстр.Получатель	= ВыборкаДетальныеЗаписи.Пользователь;
		НовСтр.Email 		= УправлениеКонтактнойИнформацией.ПолучитьEmailИзКонтактнойИнформации(ВыборкаДетальныеЗаписи.Пользователь);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеДляСервисаТребование(Док) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТребованиеНакладнаяМатериалы.Номенклатура,
		|	ТребованиеНакладнаяМатериалы.Количество,
		|	ТребованиеНакладнаяМатериалы.ЕдиницаИзмерения,
		|	ТребованиеНакладнаяМатериалы.СерияНоменклатуры,
		|	ТребованиеНакладнаяМатериалы.Ссылка.Склад
		|ИЗ
		|	Документ.ТребованиеНакладная.Материалы КАК ТребованиеНакладнаяМатериалы
		|ГДЕ
		|	ТребованиеНакладнаяМатериалы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТребованиеНакладнаяМатериалыЗаказчика.Номенклатура,
		|	ТребованиеНакладнаяМатериалыЗаказчика.Количество,
		|	ТребованиеНакладнаяМатериалыЗаказчика.Номенклатура.БазоваяЕдиницаИзмерения,
		|	ТребованиеНакладнаяМатериалыЗаказчика.СерияНоменклатуры,
		|	ТребованиеНакладнаяМатериалыЗаказчика.Ссылка.Склад
		|ИЗ
		|	Документ.ТребованиеНакладная.МатериалыЗаказчика КАК ТребованиеНакладнаяМатериалыЗаказчика
		|ГДЕ
		|	ТребованиеНакладнаяМатериалыЗаказчика.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Док);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьДанныеДляСервисаПеремещениеМалоценки(Док)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеМалоценкиВЭксплуатацииМалоценныеАктивы.Номенклатура,
		|	ПеремещениеМалоценкиВЭксплуатацииМалоценныеАктивы.ЕдиницаИзмерения,
		|	ПеремещениеМалоценкиВЭксплуатацииМалоценныеАктивы.СерияНоменклатуры,
		|	ПеремещениеМалоценкиВЭксплуатацииМалоценныеАктивы.Количество
		|ИЗ
		|	Документ.ПеремещениеМалоценкиВЭксплуатации.МалоценныеАктивы КАК ПеремещениеМалоценкиВЭксплуатацииМалоценныеАктивы
		|ГДЕ
		|	ПеремещениеМалоценкиВЭксплуатацииМалоценныеАктивы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Док);
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

Функция ПолучитьДанныеДляСервисаПеремещениеОС(Док)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеОСОС.ОсновноеСредство,
		|	1 КАК Количество
		|ИЗ
		|	Документ.ПеремещениеОС.ОС КАК ПеремещениеОСОС
		|ГДЕ
		|	ПеремещениеОСОС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Док);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ин = 0;
	Для Каждого стрТовар из Товары Цикл
		Если стрТовар.ВидРемонта = Перечисления.ВидРемонта.Платный Тогда
			Если Товары[ин].Стоимость = 0 Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Поле = "Товары["+ин+"].Стоимость";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				ТекстСообщения = НСтр("ru='Не заполнена стоимость ремонта в строке ""%1""';uk='Не заповнена вартість ремонту в рядку ""%1""'");
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ин+1);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		ин = ин + 1;
	КонецЦикла;	
	
	ин = 0;
	Для Каждого стрОборудование из Оборудование Цикл
		Если стрОборудование.ВидРемонта = Перечисления.ВидРемонта.Платный Тогда
			Если Оборудование[ин].Стоимость = 0 Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Поле = "Оборудование["+ин+"].Стоимость";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				ТекстСообщения = НСтр("ru='Не заполнена стоимость ремонта в строке ""%1""';uk='Не заповнена вартість ремонту в рядку ""%1""'");
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ин);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		ин = ин + 1;
	КонецЦикла;	
	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Стоимость") + Оборудование.Итог("Стоимость");
	
	Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
	
	Если ТипДоставки = Перечисления.ТипДоставки.НоваяПочта Тогда
		Если (ЗначениеЗаполнено(НомерТТНОтправки) И СтрДлина(НомерТТНОтправки) <> 14)
			ИЛИ (ЗначениеЗаполнено(НомерТТНПолучения) И СтрДлина(НомерТТНПолучения) <> 14) Тогда
			Сообщить(НСтр("ru='В номере ТТН меньше 14 символов';uk='У номері ТТН менше 14 символів'"));
			Отказ = Истина;		
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьНеЦифры(НомерТТНОтправки) ИЛИ ОбщегоНазначения.ЕстьНеЦифры(НомерТТНПолучения) Тогда
			Сообщить(НСтр("ru='В номере ТТН есть буквы';uk='У номері ТТН є літери'"));
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	СтатусОтправкиПоПочте = А_ОбщегоНазначенияСервер.ПолучитьСтатусОтправкиДокумента(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Дандали В. 22.04.2024 +	
	Если Не Отказ 
		И НЕ ОбменДанными.Загрузка Тогда
		Если СтатусОтправкиПоПочте <> Перечисления.СтатусыОтправкиДокументовПоПочте.ОтправленПоПочте Тогда
			А_ОбщегоНазначенияСервер.ЗаписатьДокументВОчередьНаОтправку(Ссылка);
		ИначеЕсли СтатусОтправкиПоПочте = Перечисления.СтатусыОтправкиДокументовПоПочте.ОтправленПоПочте 
			И А_ОбщегоНазначенияСервер.ПолучитьСтатусОтправкиДокумента(Ссылка) = "" Тогда
			А_ОбщегоНазначенияСервер.УстановитьСтатусОтправкиПоПочте(Ссылка, Перечисления.СтатусыОтправкиДокументовПоПочте.ОтправленПоПочте);
		КонецЕсли;
	КонецЕсли;
	//Дандали В. 22.04.2024 -
	
КонецПроцедуры
